backend/controllers/AdminuserController.php

    protected function findModel($id)
    {
        if (($model = Adminuser::findOne($id)) !== null) {
---
SELECT * FROM `adminuser` WHERE `id`='8'