common/models/Adminuser.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);
---
SELECT EXISTS(SELECT * FROM `adminuser` WHERE (`username`='admin1'))