common/models/Adminuser.php

INSERT INTO `adminuser` (`username`, `nickname`, `password`, `email`, `profile`, `create_time`) VALUES ('admin1', '噢,我想多了', '123456789', '50198456411@qq.com', '123', 0)
---
    public function register()
    {
        if(!$this->validate()){
            return null;
        }
        $this->_tmppassword = $this->password;
        $this->setPassword();
        if($this->save()){