common/models/Comment.php

    public static  function getPengdingCommentCount()
    {
        return Comment::find()->where(['status'=>1])->count();
---
SELECT COUNT(*) FROM `comment` WHERE `status`=1